package chapter04;

/**
 * 프로그램의 흐름(flow)를 바꾸는 역할을 하는 문장들을 '제어문(control statement)'이라고 한다.<br>
 * 제어문에는 '조건문과 반복문'이 있는데, 조건문은 조건에 따라 다른 문장이 수행되도록 하고, 반복문은 특정 문장들을 반복해서 수행한다.<br>
 * <h1>1. 조건문 - if, switch</h1><br>
 * 조건문은 조건식과 문장을 포함하는 블럭{}으로 구성되어 있으며, 조건식의 연산결과에 따라 실행한 문장이 달라져서 프로그램의 실행흐름을 변경할 수 있다.<br>
 * 조건문은 if문과 switch문, 두 가지가 있으며 주로 if문이 많이 사용된다. 처리할 경우의 수가 많을 때는 if문보다 switch문이 효율적이지만, switch문은 if문보다 제약이 많다.
 */
public class Chapter04 {

	/**
	 * <h5>1.1 if문</h5><br>
	 * if문은 가장 기본적인 조건문이며, 다음과 같이 '조건식'과 '괄호{}'로 이루어져 있다. 'if'의 뜻이 '만일 ~이라면...'이므로<br>
	 * <b>'만일(if) 조건식이 참(true)이면 괄호{} 안의 문장들을 수행하라.'</b>라는 의미로 이해하면 된다.<br>
	 * <pre><code>
	 *     if (조건식) {
	 *         // 조건식이 참(true)일 때 수행될 문장들을 적는다.
	 *     }
	 * </code></pre>
	 */
	class Memo1 {

	}

	/**
	 * <h5>조건식</h5><br>
	 * if문에 사용되는 조건식은 일반적으로 비교연산자와 논리연산자로 구성된다. 자바에서 조건식의 결과는 반드시 true 또는 false이어야 한다.
	 */
	class Memo2 {

	}

	/**
	 * <h5>블럭{}</h5><br>
	 * 괄호{}를 이용해서 여러 문장을 하나의 단위로 묶을 수 있는데, 이것을 '블럭(block)'이라고 한다.<br>
	 * 블럭은'{'로 시작해서, '}'로 끝나는데, '}'다음에 문장의 끝을 의미하는 ';'을 붙이지 않는다는 것에 주의하자.
	 */
	class Memo3 {

	}

	/**
	 * <h5>1.2 if-else문</h5>
	 */
	class Memo4 {

	}

}
