package chapter08;

/**
 * <h1>8. 예외처리 exception handling</h1>
 */
public class Chapter08 {

	/**
	 * <h1>1. 예외처리(exception handling)</h1><br>
	 * <h5>1.1 프로그램 오류</h5><br>
	 * 프로그램이 실행 중 어떤 원인에 의해서 오작동을 하거나 비정상적으로 종료되는 경우가 있다. <br>
	 * 이러한 결과를 초래하는 원인을 프로그램 에러 또는 오류라고 한다.<br>
	 * 이를 발생시점에 따라 '컴파일 에러(compile-time error)' 와 '런타임 에러(runtime error)'로 나눌 수 있는데,<br>
	 * 글자 그대로 '컴파일 에러'는 컴파일 할 때 발생하는 에러이고 프로그램의 실행도중에 발생하는 에러를 '런타임 에러'라고 한다.<br>
	 * 이 외에도 '논리적 에러(logical error)'가 있는데, 컴파일도 잘되고 실행도 잘되지만 의도한 것과 다르게 동작하는 것을 말한다.<br>
	 * <pre><code>
	 *     컴파일 에러 - 컴파일 시에 발생하는 에러
	 *     런타임 에러 - 실행 시에 발생하는 에러
	 *     논리적 에러 - 실행은 되지만, 의도와 다르게 동작하는 것
	 * </code></pre>
	 * <br>
	 * 소스코드를 컴파일 하면 컴파일러가 소스코드(*.java)에 대해 오타나 잘못된 구문, 자료형 체크 등의 기본적인 검사를 수행하여 오류가 있는지를 알려 준다.<br>
	 * 컴파일러가 알려 준 에러들을 모두 수정해서 컴파일을 성공적으로 마치고 나면, 클래스 파일(*.class)이 생성되고, 생성된 클래스 파일을 실행할 수 있게 되는 것이다.
	 */
	class Memo1 {

	}

}
