package chapter07;

/**
 * <h1>객체지향 프로그래밍 II</h1>
 */
public class Chapter07 {

	/**
	 * <h5>1. 상속(inheritance)</h5><br>
	 * <h6>1.1 상속의 정의와 장점</h6><br>
	 * 상속이란, 기존의 클래스를 재사용하여 새로운 클래스를 작성하는 것이다. 상속을 통해서 클래스를 작성하면 보다 적은 양의 코드로 새로운 클래스를 작성할 수 있고<br>
	 * 코드를 공통적으로 관리할 수 있기 때문에 코드의 추가 및 변경이 매우 용이하다.<br>
	 * 이러한 특징은 코드의 재사용성을 높이고 코드의 중복을 제거하여 프로그램의 생산성과 유지보수에 크게 기여한다.<br>
	 * 자바에서 상속을 구현하는 방법은 아주 간단하다. 새로 작성하고자 하는 클래스의 이름뒤에 상속받고자 하는 클래스의 이름을 키워드 'extends'와 함께 써 주기만 하면 된다.<br>
	 * 상속해주는 클래스는 '조상 클래스'라 하고 상속 받는 클래스를 '자손 클래스'라 한다.<br>
	 * <b>조상 클래스 - </b>부모(parent) 클래스, 상위(super) 클래스, 기반(base) 클래스<br>
	 * <b>자손 클래스 - </b>자식(child) 클래스, 하위(sub) 클래스, 파생된(derived) 클래스
	 */
	class Memo01 {

	}

}
