package chapter07;

/**
 * <h1>7. 인터페이스(interface)</h1>
 */
public class Chapter7_7 {

	/**
	 * <h5>7.1 인터페이스란?</h5><br>
	 * 인터페이스는 일종의 추상클래스이다. 인터페이스는 추상클래스처럼 추상메서드를 갖지만 추상클래스보다 추상화 정도가 높아서 추상클래스와 달리 몸통을 갖춘 일반 메서드 또는 멤버변수를 구성원으로 가질 수 없다.<br>
	 * 오직 추상메서드와 상수만을 멤버로 가질 수 있으며, 그 외의 다른 어떠한 요소도 허용하지 않는다.<br>
	 * 추상클래스를 부분적으로만 완성된 '미완성 설계도'라고 한다면, 인터페이스는 구현된 것은 아무 것도 없고 밑그림만 그려져 있는 '기본 설계도'라 할 수 있다.<br>
	 * 인터페이스도 추상클래스처럼 완성되지 않은 불완전한 것이기 때문에 그 자체만으로 사용되기 보다는 다른 클래스를 작성하는데 도움 줄 목적으로 작성된다.
	 */
	class Memo1 {

	}

	/**
	 * <h5>7.2 인터페이스의 작성</h5>
	 */
	class Memo2 {

	}

}
