package chapter03;

/**
 * 3.1 10진법과 2진법
 */
public class Chapter03_1 {

    /**
     * 1946년에 개발된 컴퓨터인 애니악(ENIAC)은 사람에게 익숙한 10진법을 사용하도록 설계되었으나 전기회로는 전압이 불안정해서 전압을 10단계
     * 로 나누어 처리하는 데 한계가 있었다. 1950년에 개발된 에드박(EDVAC) 은 단 두가지 단계, 전기가 흐르면 1, 흐르지 않으면 0, 만으로 동
     * 작하도록 설계되었고 매우 성공적이었다.
     * 컴퓨터는 2진수(0과1) 밖에 모르기 때문에 아래의 오른쪽과 같이 2진수로 바뀌어 저장된다.
     * ※ int타입의 크기가 4 byte이면, 32자리의 2진수로 표현해야하지만 앞의 0은 생략하였다. 0을 생략하지 않으면, '11001'이 아니라
     * '000000000000000000000000000000000000000000000000000011001'이다.
     */

}
