package chapter06;

/**
 * <h1>Chapter06. 객체지향 프로그래밍 I</h1>
 */
public class Chapter06 {

	/**
	 * <p>
	 *     <h5>1. 객체지향언어</h5><br>
	 *     1.1 객체지향언어의 역사<br>
	 *     객체지향이론의 기본 개념은 '실제 세계는 사물(객체)로 이루어져 있으며, 발생하는 모든 사건들은 사물간의 상호작용이다.'라는 것이다.
	 * </p>
	 */
	class Memo01{}

	/**
	 * <p>
	 *     <h5>1.2 객체지향언어</h5><br>
	 *  <pre>
	 * <b>1. 코드의 재사용성이 높다.</b>
	 * 새로운 코드를 작성할 때 기존의 코드를 이용하여 쉽게 작성할 수 있다.
	 *
	 * <b>2. 코드의 관리가 용이하다.</b>
	 * 코드간의 관계를 이용해서 적은 노력으로 쉽게 코드를 변경할 수 있다.
	 *
	 * <b>3. 신뢰성이 높은 프로그래밍을 가능하게 한다.</b>
	 * 제어자와 메서드를 이용해서 데이터를 보호하고 올바른 값을 유지하도록 하며,
	 * 코드의 중복을 제거하여 코드의 불일치로 인한 오동작을 방지할 수 있다.
	 * </pre>
	 *     <br>
	 *     <b>객체지향개념을 학습할 때 재사용성과 유지보수 그리고 중복된 코드의 제거, 이 세가지 관점에서 보면 보다 쉽게 이해할 수 있을 것이다.</b>
	 * </p>
	 */
	class Memo02{}

}
