package chapter06;

/**
 * <h1>2. 클래스와 객체</h1>
 */
public class Chapter06_2 {

	/**
	 * <p>
	 *     <h5>2.1 클래스와 객체의 정의와 용도</h5><br>
	 *     클래스란 '객체를 정의해놓은 것', 또는 클래스는 '객체의 설계도 또는 틀'이라고 정의할 수 있다.<br>
	 *     클래스는 객체를 생성하는데 사용되며, 객체는 클래스에 정의된 대로 생성된다.<br>
	 *     <b>클래스의 정의</b> 클래스란 객체를 정의해 놓은 것이다.<br>
	 *     <b>클래스의 용도</b> 클래스는 객체를 생성하는데 사용된다.<br>
	 *     객체의 사전적인 정의는 '실제로 존재하는 것'이다. 객체지향이론에서는 사물과 같은 유형적인 것 뿐만 아니라, 개념이나 논리와 같은<br>
	 *     무형적인 것들도 객체로 간주한다.<br>
	 *     프로그래밍에서의 객체는 클래스에 정의된 내용대로 메모리에 생성된 것을 뜻한다.<br>
	 *     <b>객체의 정의</b> 실제로 존재하는 것. 사물 또는 개념<br>
	 *     <b>객체의 용도</b> 객체가 가지고 있는 기능과 속성에 따라 다름<br>
	 *     <b>유형의 객체</b> 책상, 의자, 자동차, TV와 같은 사물<br>
	 *     <b>무형의 객체</b> 수학공식, 프로그램 에러와 같은 논리나 개념<br>
	 * </p>
	 */
	class Memo01{}

}
