package chapter02;

/**
 * 변수 variable
 */
public class Chapter02 {

    /**
     * 1. 변수(variable)
     * 1.1 변수(variable)란?
     * 프로그래밍언어에서의 변수(variable)란, 값을 저장할 수 있는 메모리상의 공간을 의미한다.
     * "변수란, 단 하나의 값을 저장할 수 있는 메모리 공간."
     * 하나의 변수에 단 하나의 값만 저장할 수 있으므로, 새로운 값을 저장하면 기존의 값은 사
     * 라진다.
     */

    /**
     * 1.2 변수의 선언과 초기화
     * 변수를 사용하려면 먼저 변수를 선언해야한다.
     * int age; // age 라는 이름의 변수를 선언
     * ↓   ↘
     * 변수타입 변수이름
     * '변수타입'은 변수에 저장될 값이 어떤 '타입(type)'인지를 저장하는 것이다.
     * 자바는 정수형, 실수형, 문자형 등 다양한 타입을 제공한다.
     * '변수이름'은 말 그대로 변수에 붙ㄴ인 이름이다. 변수는'값을 저자할 수 있는 메모리 공간'
     * 이므로 변수의 이름은 메모리 공간에 이름을 붙여주는 것이다.
     * 같은 이름의 변수가 여러 개 존재해서는 안된다.
     * 변수를 선언하면, 메모리의 빈 공간에 '변수타입'에 알맞은 크기의 저장공간이 확보되고,
     * 앞으로 이 저장공간은 '변수이름'을 통해 사용할 수 있게 된다.
     * 변수의 초기화
     * 변수를 선언한 이후부터는 변수를 사용할 수 있으나, 그 전에 반드시 변수를 '초기화
     * (initialization)'해야 한다. 메모리는 여러 프로그램이 공유하는 자원이므로 전에 다른 프
     * 로그램에 의해 저장된 '알 수 없는 값(쓰레기값, garbage value)'이 남아 있을 수 있기 때문
     * 이다.
     * 변수에 값을 저장할 때는 대입 연산자'='를 이용한다.
     * 자바에서는 오른쪽의 값을 왼쪽(변수)에 저장하라는 뜻이다. 대입연산자
     * 의 왼쪽에는 반드시 변수가 와야 한다.
     * 변수는 한 줄에 하나씩 선언하는 것이 보
     * 통이지만, 탕비이 같은 경우 콤마','를 구분자로 여러 변수를 한 줄에 선언하기도 한다.
     * 변수는 사용되기 전
     * 에 적할한 값으로 초기화하는 것이 좋다.
     * "변수의 초기화란, 변수를 사용하기 전에 처음으로 값을 저장하는 것"
     * 변수에 값을 저장하는 '대입연산(=)'은 우변의 모든 계산이 끝난 후에 제
     * 일 마지막에 수행된다.
     */

}










