package chapter02;

/**
 * 3.3 8진법과 16진법
 */
public class Chapter02_3_3 {

    /**
     * 8진수는 2진수 3자리를, 16진수는 2진수 4자리를 각각 한자리로 표현할 수 있기 때문에 자리수가 짧아져서 알아보기 쉽고 서로 간의 변환방법
     * 또한 매우 간단하다.
     * 8진법은 값을 표현하는데 8개의 기호가 필요하므로 0~7의 숫자를 기호로 사용하면 되지만, 16진법은 16개의 기호가 필요하므로 0~9의 숫자만
     * 으로는 부족하다. 그래서 6개의 문자(A~F)를 추가로 사용한다.
     */

    /**
     * 2진수를 8진수, 16진수로 변환
     * 2진수를 8진수로 변환하려면, 2진수를 뒤에서부터 3자리씩 끊어서 그에 해당하는 8진수로 바꾸면 된다. 8은 2^3이기 때문에, 8진수 한 자리가
     * 2진수 3자리를 대신할 수 있는 것이다. 2진수를 16진수로 변환하는 방법 역시 이와 비슷한데, 3자리가 아닌 4자리씩 끊어서 바꾼다는 점만 다
     * 르다.
     */

}
